school/econ/econNotes.tex
% Created 2020-09-24 Thu 11:11
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Sudhan Chitgopkar}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={Sudhan Chitgopkar},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.3 (Org mode 9.1.9)}, 
 pdflang={English}}
\begin{document}

\tableofcontents

\section{Chapter 5}
\label{sec:org1709f5f}
\subsection{Introduction}
\label{sec:orgff373f0}
\begin{itemize}
\item Efficiency: Are we getting the most that we can out of our scarce resources?
\item Equity: Is what we're getting out of our resources fairly dstributed?
\end{itemize}
\subsection{Resource Allocation Methods}
\label{sec:orgfaa2ea8}
\begin{itemize}
\item Scarce resources might be allocated by
\begin{itemize}
\item Market price
\item Command (government, organizations and their hierarchical structures, rations, etc.)
\item Majority rule
\item Contest
\item First come, first served
\item Lottery
\item Force
\end{itemize}
\end{itemize}
\subsection{Demand and Consumer Surplus}
\label{sec:org43a6901}
\begin{itemize}
\item Demand, Willingness to Pay, and Value
\begin{itemize}
\item Value is what we get, price is what we pay
\item The value of one more unit of a good or service is its marginal benefit
\item The maxumum price that a person is willing to pay reveals marginal benefit
\item The demand curve is a marginal benefit curve
\end{itemize}
\item Individual Demand and Market Demand
\begin{itemize}
\item The relationship between the price of a good and the quantity demanded
\begin{itemize}
\item by one person: individual demand
\item by all buyers in the market: market demand
\end{itemize}
\item The market demand curve is the horizontal sum of individual demand curves
\end{itemize}
\item Consumer Surplus
\begin{itemize}
\item the excess of the benefit recieved from a good over the amount paid for it
\item Calculate as the marginal benefit of a good - price, summed over quantity bought
\item Market consumer surplus is the sum of individual consumer surplus
\end{itemize}
\end{itemize}
\subsection{Supply and Producer Surplus}
\label{sec:org80f674c}
\begin{itemize}
\item Supply and Marginal Cost
\begin{itemize}
\item To make a profit, firms must sell their output for a price > cost of production
\item Cost is what the producer gives up, price is what the producer recieves
\end{itemize}
\item Supply, Marginal Cost, and Minimum Supply-Price
\begin{itemize}
\item The cost of one more unit of a good or service is the marginal cost
\item The minimum price that a firm is willing to accept is its marginal cost
\item A supply curve is a marginal cost curve
\end{itemize}
\item Producer surplus
\begin{itemize}
\item The excess of the amount recieved from a sale over the cost of production
\item Calculate as price - marginal cost, summed over quantity
\end{itemize}
\end{itemize}
\subsection{Is the Market Efficient?}
\label{sec:org34225d9}
\begin{itemize}
\item Efficiency of Competitive Equilibrium
\begin{itemize}
\item Resources are allocated efficienty when marginal social benefit = marginal social cost
\item If nobody other than producers and consumers are effected, the competitive equilibrium
can allocate resources efficiently
\end{itemize}
\end{itemize}
\subsection{Underproduction and Overproduction}
\label{sec:org1070b71}
\begin{itemize}
\item Market failure occurs upon an inefficient outcome (overproduction or underproduction)
\item Deadweight loss is the quantification of inefficiency by calculating the area of the 
full triangle before or after the equilibrium on a marginal social benefit \& cost curve
\end{itemize}
\subsection{Market Failure}
\label{sec:org940003a}
\begin{itemize}
\item Sources of Market Failure:
\begin{itemize}
\item Price and quantity regulations -> blocks price \& production, leads to underproduction
\item Taxes and subsidies -> taxes lead to underproduction, subsidies lead to overproduction
\item Externalities -> a cost/benefot affecting someone other than seller/buyer, leads to either
underproduction or overproduction
\item Public Goods and Common Resources
\begin{itemize}
\item Public goods: benefit everyone, nobody can be excluded. Nobody wants to pay for a public
good, leading to underproduction.
\item Common resouce: owned by nobody, but can be used by everyone. Leads to tragedy of the commons
and overproduction
\item Monopoly -> self-interest to produce profits results in underproduction
\item High Transaction costs -> leads to underproduction
\end{itemize}
\end{itemize}
\end{itemize}
\subsection{Fairness}
\label{sec:orgdb044d4}
\begin{itemize}
\item Ideas of fairness can be divided into two rules
\begin{itemize}
\item Not fair if the result isn't fair
\begin{itemize}
\item Utilitarianism: greatest happiness for greatest number
\end{itemize}
\item Not far if the rules aren't fair
\end{itemize}
\end{itemize}
\subsubsection{It's not Fair if the Results aren't Fair}
\label{sec:org78b5039}
\begin{itemize}
\item If everyone gets the same marginal utility from a given amount of income, and 
if the marginal benefit of income decreases as income increases, then taking a dollar from a 
richer person and giving it to a poorer person increases total benefit
\item Only when income is equally distributed has the greatest happiness been achieved
\item Utlitarianism ignores the cost of making income transfers
\item Recognizing these costs leads to the big tradeoff between efficiency and fairness
\end{itemize}
\subsubsection{It's not Fair if Rules aren't Fair}
\label{sec:org86109c4}
\begin{itemize}
\item Symmetry principle: the requirement that people in similar situation be treated similarly
\item Nozick suggests that fairness is based on two rules
\begin{itemize}
\item The state must create and enforce laws that establish/protect private property
\item Private property may be transferred form one person to another only by voluntary exchange
\end{itemize}
\end{itemize}
\section{Chapter 4}
\label{sec:orgfa0692a}
\subsection{Introduction to Elasticity}
\label{sec:org28cfecf}
\begin{itemize}
\item closeness of substitutes is critical to understanding elasticity of supply and demand
\end{itemize}
\subsection{Elasticity of Demand}
\label{sec:orga46c34b}
\subsubsection{Calculting Elasticity of Demand}
\label{sec:orgb7db170}
\begin{itemize}
\item Price elasticity of demand is a unit free measure of the responsiveness of quantity 
demanded to a change in price when all other influences stay the same
\item percentage change in quantity demanded/percentage change in price
\item percent change in price is calculated as change in price/average of two goods/services
\end{itemize}
\subsubsection{Inelastic and Elastic Demand}
\label{sec:orgffb83fb}
\begin{itemize}
\item Demand can be inelastic, unit elastic, or elastic
\item Elasticity can range from 0 to infinity
\item If quantity demanded doesn't change when the price changes, price elasticity = 0 and the good
has perfectly inelastic demand (Vertical demand curve)
\item If price elasticity equals exactly one, the good has unit elastic demand
\item If price elasticity of demand is less than 1 then the good has inelastic demand
\item If price elasticity is greater than 1, then the good has an elastic demand
\item If the price elasticity is infinity, the good has a perfectly 
elastic demand (Horizontal demand curve)
\end{itemize}
\subsection{Factors Influencing Elasticity of Demand}
\label{sec:org870621c}
\subsubsection{Closeness of substitutes}
\label{sec:org96817da}
\begin{itemize}
\item the closer the substitutes, the more elastic the demand for a good or service
\item necessities, such as food or housing, generally have an inelastic demands
\item luxuries, such as exotic vacations, generally have elastic demand
\end{itemize}
\subsubsection{Proportion of Income Spent on Good}
\label{sec:orgbe2fa5d}
\begin{itemize}
\item The greater the portion of income consumers spend on a good, the larger the elasticity of demand
\end{itemize}
\subsubsection{Time Elapsed Since Price Change}
\label{sec:org642e1e6}
\begin{itemize}
\item The more time consumers have to adjust to a price change or the longer the good can be stored
without losing its value, the more elastic the demand for the good
\end{itemize}
\subsection{Elasticity on a Linear Demand Curve \& Total Revenue Test}
\label{sec:org37e5fc6}
\begin{itemize}
\item At the midpoint of a linear demand curve, demand is unit elastic
\item At prices above the midpoint, demand is elastic
\item At prices below the midpoint, demand is inelastic
\end{itemize}
