school/econ/econNotes.org
*** Total Revenue and Elasticity
- Total revenue from the sale of a good or service = price of good * quantity sold
- Raising the price doesn't always increase total revenue
- If demand is elastic, a 1% price cut increases quantity sold by >1%, total revenue decreases
- If demand is inelastic, a 1% price cut increases the quantity <1%, total revenue decreases
- If demand is unit elastic a 1% price cut increases the quantity sold by 1%, total revenue same
*** Total Revenue Test
- a method of estimating the price elasticity of demand by
  observing the change in total revenue that results from a price change
- If a price cut increases total revenue, demand is elastic
- If price cut decreases total revenue demand is inelastic
- If a price cut doesn't change total revenue, demand is unit elastic
- On a bell curve, increase shows elastic, decrease shows inelastic, and peak is unit elastic
** Income Elasticity and Cross Elasticity of Demand
*** Income Elasticity
- Income elasticity of demand measures how the quantity demanded responds to a change in income
  - % change in quantity demanded/ % change in income
- If income elasticity is >1, demand is income elastic and the good is a normal good
- If the income elasticity is 0<x<1, demand is income inelastic and the good is normal elastic
- If income elasticity is <0, the good is an inferior good
*** Cross Elasticity of Demand
- Measure of the responsiveness of demand to change in the price of a substitute/complement 
  - % change in quantity demanded/ % change in price of substitute/complement
- Cross elasticity of demand is:
  - positive for a substitute
  - negative for a complement
** Elasticity of Supply
- Elasticity of supply: measures the responsiveness of quantity suppled to a change in price
  - % change in quantity supplied / % change in price
- Supply is perfectly inelastic when supply curve is vertical and elasticity = 0
- Supply is unit elastic if the supply curve is linear and passes through the origin 
- Supply is perfectly elastic when the supply curve is elastic and the elasticity = infinity
*** Factors Influencing Elasticity of Supply
- Depends on
  - Resource substitution possibilities
    - The easier it is to substitute among resources used, the greater the elasticity of supply
  - Time frame for supply decision
    - Momentary supply - perfectly inelastic for physical goods
    - Short-run supply is somewhat elastoc
    - Long-run supply is the most elastic
* Chapter 3
** Introduction
- Markets are any arrangements that enable buyers and sellers to get information
  and do business with each other
- Competitive Market: many buyers and many sellers so no single buyer or seller can
  influence prices
** Demand
- Reflects the buyers' side of the market
- If you demand something, you
  - want it
  - can afford it
  - have a definite plan to buy it
- Quantity demanded: amount that consumers plan to buy 
  during a particular time @ a particular price
- Law of Demand: other things remaining the same, the higher the price of a good, the smaller
  the quantity demanded (and vice versa)
- Substitution Effect: when the relative price of a good rises, people seek substitutes so
  the quantity demanded decreases
- When the price of a good rises relative to income, people cannot afford all the things
  they previously bought so quantity demanded decreases
- Demand Curve and Demand Schedule
  - the term demand refers to the entire relationship between good and quantity demanded
- Demand Curve: exhibits relationshit between quantity demanded and price when all other
  consumers' planned purchases remain constant
- Willingess and Ability to Pay
  - The smaller the quantity available, the higher the price someone is willing to pay for
    another unit
  - Willingness to pay measures marginal benefit
- Changes in Demand: when some influence on buying plans other than price changes, there is a
  shift in demand for that good
- 6 factors influencing demand:
  - Price of related goods
    - substitutes - good that can be used in place of another
    - complement - good that is used in conjunction with another
    - If $ substitute inc or $ complement dec, demand of good inc
    - if $ substitute dec or $ complement inc, demand of good dec
  - Expected future prices
    - if expected future price inc, current demand inc
    - if expected future price dec, current demand dec
  - Income
    - normal good: a good for which demand inc as income inc
    - inferior good: a good for which demand dec as income inc
    - if expected future income increases/credit is easier to get, current demand inc
  - Population
    - The higher the population, the higher the demand
  - Preferences
    - People with the same income have different demands if they have different preferences
** Supply
- If a firm is a supplier, they
  - have the resources and tech to produce it
  - can profit from producing it
  - has a definite plan to produce and sell it
- Quantity supplied: the amount producers plan to sell during a given time at a particular price
- Law of Supply: Other things remaning the same, the higher the price of a good, the greater the
  quantity supplied (and vice versa).
- Supply Curve and Supply Schedule
  - Minimum supply price: As quantity produced inc, marginal cost inc.
  - The lowest price at which someone is willing to sell an additional unit rises
  - This lowest price is called the marginal cost
- Changes in Supply
  - Increases in supply shifts the curve to the right (and vice versa)
- Factors that affect Supply
  - Prices of factors of production
    - If the price of an input inc, supply dec; curve shifts left
  - Prices of related goods produced
    - denoted by substitute for production, not just substitute
    - supply of a good inc if price of a substitute dec
    - complements in production: goods that must be produced together (beef & leather)
    - supply of a good inc if the price of a complement in production inc
  - Expected Future Prices
    - If expected future price inc, current supply dec
  - Number of Suppliers
    - as number of suppliers inc, supply inc
  - Technology
    - Advances in technology lower the cost of making existing products
    - inc in technology means inc in supply
  - State of Nature
    - natural forces and disasters can dec supply
