school/econ/econNotes.tex
\subsubsection{Total Revenue and Elasticity}
\label{sec:org2b9ebb8}
\begin{itemize}
\item Total revenue from the sale of a good or service = price of good * quantity sold
\item Raising the price doesn't always increase total revenue
\item If demand is elastic, a 1\% price cut increases quantity sold by >1\%, total revenue decreases
\item If demand is inelastic, a 1\% price cut increases the quantity <1\%, total revenue decreases
\item If demand is unit elastic a 1\% price cut increases the quantity sold by 1\%, total revenue same
\end{itemize}
\subsubsection{Total Revenue Test}
\label{sec:org2053d19}
\begin{itemize}
\item a method of estimating the price elasticity of demand by
observing the change in total revenue that results from a price change
\item If a price cut increases total revenue, demand is elastic
\item If price cut decreases total revenue demand is inelastic
\item If a price cut doesn't change total revenue, demand is unit elastic
\item On a bell curve, increase shows elastic, decrease shows inelastic, and peak is unit elastic
\end{itemize}
\subsection{Income Elasticity and Cross Elasticity of Demand}
\label{sec:org20ff2b4}
\subsubsection{Income Elasticity}
\label{sec:orge3b118f}
\begin{itemize}
\item Income elasticity of demand measures how the quantity demanded responds to a change in income
\begin{itemize}
\item \% change in quantity demanded/ \% change in income
\end{itemize}
\item If income elasticity is >1, demand is income elastic and the good is a normal good
\item If the income elasticity is 0<x<1, demand is income inelastic and the good is normal elastic
\item If income elasticity is <0, the good is an inferior good
\end{itemize}
\subsubsection{Cross Elasticity of Demand}
\label{sec:org8769e13}
\begin{itemize}
\item Measure of the responsiveness of demand to change in the price of a substitute/complement 
\begin{itemize}
\item \% change in quantity demanded/ \% change in price of substitute/complement
\end{itemize}
\item Cross elasticity of demand is:
\begin{itemize}
\item positive for a substitute
\item negative for a complement
\end{itemize}
\end{itemize}
\subsection{Elasticity of Supply}
\label{sec:org19f7027}
\begin{itemize}
\item Elasticity of supply: measures the responsiveness of quantity suppled to a change in price
\begin{itemize}
\item \% change in quantity supplied / \% change in price
\end{itemize}
\item Supply is perfectly inelastic when supply curve is vertical and elasticity = 0
\item Supply is unit elastic if the supply curve is linear and passes through the origin
\item Supply is perfectly elastic when the supply curve is elastic and the elasticity = infinity
\end{itemize}
\subsubsection{Factors Influencing Elasticity of Supply}
\label{sec:org2d90069}
\begin{itemize}
\item Depends on
\begin{itemize}
\item Resource substitution possibilities
\begin{itemize}
\item The easier it is to substitute among resources used, the greater the elasticity of supply
\end{itemize}
\item Time frame for supply decision
\begin{itemize}
\item Momentary supply - perfectly inelastic for physical goods
\item Short-run supply is somewhat elastoc
\item Long-run supply is the most elastic
\end{itemize}
\end{itemize}
\end{itemize}
\section{Chapter 3}
\label{sec:org5ef4665}
\subsection{Introduction}
\label{sec:orgd5dd7e6}
\begin{itemize}
\item Markets are any arrangements that enable buyers and sellers to get information
and do business with each other
\item Competitive Market: many buyers and many sellers so no single buyer or seller can
influence prices
\end{itemize}
\subsection{Demand}
\label{sec:org2750468}
\begin{itemize}
\item Reflects the buyers' side of the market
\item If you demand something, you
\begin{itemize}
\item want it
\item can afford it
\item have a definite plan to buy it
\end{itemize}
\item Quantity demanded: amount that consumers plan to buy 
during a particular time @ a particular price
\item Law of Demand: other things remaining the same, the higher the price of a good, the smaller
the quantity demanded (and vice versa)
\item Substitution Effect: when the relative price of a good rises, people seek substitutes so
the quantity demanded decreases
\item When the price of a good rises relative to income, people cannot afford all the things
they previously bought so quantity demanded decreases
\item Demand Curve and Demand Schedule
\begin{itemize}
\item the term demand refers to the entire relationship between good and quantity demanded
\end{itemize}
\item Demand Curve: exhibits relationshit between quantity demanded and price when all other
consumers' planned purchases remain constant
\item Willingess and Ability to Pay
\begin{itemize}
\item The smaller the quantity available, the higher the price someone is willing to pay for
another unit
\item Willingness to pay measures marginal benefit
\end{itemize}
\item Changes in Demand: when some influence on buying plans other than price changes, there is a
shift in demand for that good
\item 6 factors influencing demand:
\begin{itemize}
\item Price of related goods
\begin{itemize}
\item substitutes - good that can be used in place of another
\item complement - good that is used in conjunction with another
\item If \$ substitute inc or \$ complement dec, demand of good inc
\item if \$ substitute dec or \$ complement inc, demand of good dec
\end{itemize}
\item Expected future prices
\begin{itemize}
\item if expected future price inc, current demand inc
\item if expected future price dec, current demand dec
\end{itemize}
\item Income
\begin{itemize}
\item normal good: a good for which demand inc as income inc
\item inferior good: a good for which demand dec as income inc
\item if expected future income increases/credit is easier to get, current demand inc
\end{itemize}
\item Population
\begin{itemize}
\item The higher the population, the higher the demand
\end{itemize}
\item Preferences
\begin{itemize}
\item People with the same income have different demands if they have different preferences
\end{itemize}
\end{itemize}
\end{itemize}
\subsection{Supply}
\label{sec:org01d3b74}
\begin{itemize}
\item If a firm is a supplier, they
\begin{itemize}
\item have the resources and tech to produce it
\item can profit from producing it
\item has a definite plan to produce and sell it
\end{itemize}
\item Quantity supplied: the amount producers plan to sell during a given time at a particular price
\item Law of Supply: Other things remaning the same, the higher the price of a good, the greater the
quantity supplied (and vice versa).
\item Supply Curve and Supply Schedule
\begin{itemize}
\item Minimum supply price: As quantity produced inc, marginal cost inc.
\item The lowest price at which someone is willing to sell an additional unit rises
\item This lowest price is called the marginal cost
\end{itemize}
\item Changes in Supply
\begin{itemize}
\item Increases in supply shifts the curve to the right (and vice versa)
\end{itemize}
\item Factors that affect Supply
\begin{itemize}
\item Prices of factors of production
\begin{itemize}
\item If the price of an input inc, supply dec; curve shifts left
\end{itemize}
\item Prices of related goods produced
\begin{itemize}
\item denoted by substitute for production, not just substitute
\item supply of a good inc if price of a substitute dec
\item complements in production: goods that must be produced together (beef \& leather)
\item supply of a good inc if the price of a complement in production inc
\end{itemize}
\item Expected Future Prices
\begin{itemize}
\item If expected future price inc, current supply dec
\end{itemize}
\item Number of Suppliers
\begin{itemize}
\item as number of suppliers inc, supply inc
\end{itemize}
\item Technology
\begin{itemize}
\item Advances in technology lower the cost of making existing products
\item inc in technology means inc in supply
\end{itemize}
\item State of Nature
\begin{itemize}
\item natural forces and disasters can dec supply
\end{itemize}
\end{itemize}
\end{itemize}
