school/econ/econNotes.org
** Equilibrium
- Equilibrium: a situation in which opposing forces balance each other
- Equilibrium Price: the price at which quantity demanded = quantity supplied
- Equilibrium Quantity: quantity bought and sold at equilibrium cost
- Price Regulation
  - Price regulates buying and selling plans
  - Price adjusts when plans don't match
- Price adjustments
  - Surplus forces prices down
  - Shortage forces prices up
- Increases in demand
  - When demand increases without changes in supply, shortages occur
  - Price therefore increaes
- Decrease in demand
  - At the original price, there is a surplus
  - Price therefore falls
- Increase in supply
  - At the original price, there is a surplus
  - Price therefore falls
- Decrease in supply
  - At the original price, there is a shortage
  - Price therefore increases
* Chapter 1
** Scarcity
- all economic questions arise because we want more than we can get
- inability to satisfy all wants because of scarcity
- scarcity = limited resources
** Definition of Economics
- because we face scarcity, we must make choices
- incentive = a reward that encourages an action or a penalty that discourages an action
- economics is the social science that studies the choices that individuals, businesses, etc.
 make as they cope with scarcity and the incentives that influence and reconcile those choices
- Economics divides into two parts:
  - Microeconomics = study of choices that individuals and businesses make & how those choices
    interact with markets and the influence of governments
  - Macroeconomics = the study of the performance of national and global economies
** 6 Key Ideas
- a choice is a tradeoff: ever choice is an exchange giving up one thing for another
- making a rational choice: a rational choice compares costs and benefits, maximizing benefit
- benefit = what you gain: the gain or pleasure something brings about, determined by preferences
  - preferences = what a person likes, dislikes, and the intensity of those feelings
- cost = what must be given up
   - opportunity cost = highest val alternative that must be given up
- choosing at the margin: the benefit of pursuing an incremental increase in some action
  is marginal benefit of that action
  - the opportunity cost of pursuing an incremental increase in some action is marginal cost
  - if marginal benefit > marginal cost, rational choice is to do more of that action
- choices respond to incentives: a change in marginal cost/benefit changes our incentives & choices
** Positive & Normative
- economists distinguish between two types of statements: 
  - positive statements: can be tested by checking the facts
  - normative statements: express an untestable opinion
- economists as social scientists
  - economists test economic models
  - economic model = a description of some aspect of the world w only the necessary features
- economists as policy advisors
** Resources & Highest Valued Use
- the scope of economics: 
  - how do choices end up determining "what, how, and for whom" goods and services get produced
- goods and services are produced using productive resources called factors of production
  - land
  - labor
  - capital
  - entrepreneurship
- who gets goods and services depends on income
  - land earns rent, labor earns wages, capital earns interest, entrepreneruship earns profit
- **resources gravitate towards their highest value use** 
** Self Interest & Social Interest
- self interest = choices that are made because you think they are the best for you
- social interest = choices that are best for society as a whole
- social interest has two dimensions: 
  - efficiency: resource use is efficient if it is not possible to make someone better off without
    making someone else worse off (no waste to be eliminated)
  - fair shares/equity: refers to the fairness with which resource division occurs in a society
- tension between self & social interest: information revolution, climate change, globalization
  
