school/econ/econNotes.tex
\subsection{Equilibrium}
\label{sec:org0db2822}
\begin{itemize}
\item Equilibrium: a situation in which opposing forces balance each other
\item Equilibrium Price: the price at which quantity demanded = quantity supplied
\item Equilibrium Quantity: quantity bought and sold at equilibrium cost
\item Price Regulation
\begin{itemize}
\item Price regulates buying and selling plans
\item Price adjusts when plans don't match
\end{itemize}
\item Price adjustments
\begin{itemize}
\item Surplus forces prices down
\item Shortage forces prices up
\end{itemize}
\item Increases in demand
\begin{itemize}
\item When demand increases without changes in supply, shortages occur
\item Price therefore increaes
\end{itemize}
\item Decrease in demand
\begin{itemize}
\item At the original price, there is a surplus
\item Price therefore falls
\end{itemize}
\item Increase in supply
\begin{itemize}
\item At the original price, there is a surplus
\item Price therefore falls
\end{itemize}
\item Decrease in supply
\begin{itemize}
\item At the original price, there is a shortage
\item Price therefore increases
\end{itemize}
\end{itemize}
\section{Chapter 1}
\label{sec:org1aff81b}
\subsection{Scarcity}
\label{sec:orgea3b6c5}
\begin{itemize}
\item all economic questions arise because we want more than we can get
\item inability to satisfy all wants because of scarcity
\item scarcity = limited resources
\end{itemize}
\subsection{Definition of Economics}
\label{sec:orgd4c51a2}
\begin{itemize}
\item because we face scarcity, we must make choices
\item incentive = a reward that encourages an action or a penalty that discourages an action
\item economics is the social science that studies the choices that individuals, businesses, etc.
make as they cope with scarcity and the incentives that influence and reconcile those choices
\item Economics divides into two parts:
\begin{itemize}
\item Microeconomics = study of choices that individuals and businesses make \& how those choices
interact with markets and the influence of governments
\item Macroeconomics = the study of the performance of national and global economies
\end{itemize}
\end{itemize}
\subsection{6 Key Ideas}
\label{sec:org05f67e1}
\begin{itemize}
\item a choice is a tradeoff: ever choice is an exchange giving up one thing for another
\item making a rational choice: a rational choice compares costs and benefits, maximizing benefit
\item benefit = what you gain: the gain or pleasure something brings about, determined by preferences
\begin{itemize}
\item preferences = what a person likes, dislikes, and the intensity of those feelings
\end{itemize}
\item cost = what must be given up
\begin{itemize}
\item opportunity cost = highest val alternative that must be given up
\end{itemize}
\item choosing at the margin: the benefit of pursuing an incremental increase in some action
is marginal benefit of that action
\begin{itemize}
\item the opportunity cost of pursuing an incremental increase in some action is marginal cost
\item if marginal benefit > marginal cost, rational choice is to do more of that action
\end{itemize}
\item choices respond to incentives: a change in marginal cost/benefit changes our incentives \& choices
\end{itemize}
\subsection{Positive \& Normative}
\label{sec:org674d2c6}
\begin{itemize}
\item economists distinguish between two types of statements: 
\begin{itemize}
\item positive statements: can be tested by checking the facts
\item normative statements: express an untestable opinion
\end{itemize}
\item economists as social scientists
\begin{itemize}
\item economists test economic models
\item economic model = a description of some aspect of the world w only the necessary features
\end{itemize}
\item economists as policy advisors
\end{itemize}
\subsection{Resources \& Highest Valued Use}
\label{sec:orga8e29db}
\begin{itemize}
\item the scope of economics: 
\begin{itemize}
\item how do choices end up determining "what, how, and for whom" goods and services get produced
\end{itemize}
\item goods and services are produced using productive resources called factors of production
\begin{itemize}
\item land
\item labor
\item capital
\item entrepreneurship
\end{itemize}
\item who gets goods and services depends on income
\begin{itemize}
\item land earns rent, labor earns wages, capital earns interest, entrepreneruship earns profit
\end{itemize}
\item \textbf{\textbf{resources gravitate towards their highest value use}}
\end{itemize}
\subsection{Self Interest \& Social Interest}
\label{sec:org1125654}
\begin{itemize}
\item self interest = choices that are made because you think they are the best for you
\item social interest = choices that are best for society as a whole
\item social interest has two dimensions: 
\begin{itemize}
\item efficiency: resource use is efficient if it is not possible to make someone better off without
making someone else worse off (no waste to be eliminated)
\item fair shares/equity: refers to the fairness with which resource division occurs in a society
\end{itemize}
\item tension between self \& social interest: information revolution, climate change, globalization
\end{itemize}
\end{document}